import React from "react";

import s from "./GroupWorks.module.less";

import Table from "@src/components/common/Table";

const GroupWorks = ({ nameGroup }) => {

    return (
        <section className={s.main}>
            <h3>Группа {nameGroup}</h3>
            <Table
                header={['Название', 'Статус', 'Всего работ', 'На проверке', 'Не принято', 'Принято', 'Выдана', 'Сдать до']}
                rows={[
                    ['Какое-то очень сложное название из большого количества букв2', 'Активна', 32, 21, 4, 7, '21.03.2019', '29.04.2019'],
                    ['Название', 'Активна', 32, 21, 4, 7, '21.03.2019', '29.04.2019'],
                    ['Название', 'Активна', 32, 21, 4, 7, '21.03.2019', '29.04.2019'],
                    ['Название', 'Завершена', 32, 21, 4, 7, '21.03.2019', '29.04.2019'],
                    ['Название', 'Завершена', 32, 21, 4, 7, '21.03.2019', '29.04.2019']
                ]}
                buttonText={'Добавить задание'}
                bigFirst={true}
            />
        </section>
    );
};

export default GroupWorks;